{
  "index": [
    null,
    "Animal Friendship",
    "Barkskin",
    "Beast Sense",
    "Charm Person",
    "Create Or Destroy Water",
    "Darkvision",
    "Detect Magic",
    "Detect Poison And Disease",
    "Enhance Ability",
    "Εντangle",
    "Faerie Fire",
    "Find Traps",
    "Flame Blade",
    "Flaming Sphere",
    "Fog Cloud",
    "Goodberry",
    "Gust Of Wind",
    "Healing Word",
    "Hold Person",
    "Ice Storm",
    "Jump",
    "Locate Animals Or Plants",
    "Locate Objeсt",
    "Mending",
    "Moonbeam",
    "Poison Spray",
    "Produce Flame",
    "Protection From Poison",
    "Purify Food And Drink",
    "Resistance",
    "Shillelagh",
    "Speak With Animals",
    "Speak With Plants",
    "Spike Growth",
    "Thorn Whip",
    "Thunderwave"
  ],
  "undefined": "{\"spellId\":\"idzbeu\",\"level\":\"first\",\"spell_name\":\"Animal Friendship\",\"casting_time\":\"action\",\"range\":\"30 feet\",\"components\":[\"V\",\"S\",\"M\",\"a morsel of food) Duration: 24 hours This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spells ends. At Higher Levels. When you cast this speil using a spell slot of 2nd level or higher, you can affect one additional beast for each slot level above 1st.\"],\"duration\":\"24 hours\",\"description\":\"This spell lets you convince a beast that you mean it no\\nharm. Choose a beast that you can see within range.\\nIt must see and hear you. If the beast's Intelligence is\\n4 or higher, the spell fails. Otherwise, the beast must\\nsucceed on a Wisdom saving throw or be charmed\\nby you for the spell's duration. If you or one of your\\ncompanions harms the target, the spells ends.\\nAt Higher Levels. When you cast this speil using\\na spell slot of 2nd level or higher, you can affect one\\nadditional beast for each slot level above 1st.\\n\",\"save\":\"Wisdom\"}",
  "idzbeu": {
    "spellId": "idzbeu",
    "level": "first",
    "spell_name": "Animal Friendship",
    "casting_time": "action",
    "range": "30 feet",
    "components": [
      "V",
      "S",
      "M",
      "a morsel of food) Duration: 24 hours This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spells ends. At Higher Levels. When you cast this speil using a spell slot of 2nd level or higher, you can affect one additional beast for each slot level above 1st."
    ],
    "duration": "24 hours",
    "description": "This spell lets you convince a beast that you mean it no\nharm. Choose a beast that you can see within range.\nIt must see and hear you. If the beast's Intelligence is\n4 or higher, the spell fails. Otherwise, the beast must\nsucceed on a Wisdom saving throw or be charmed\nby you for the spell's duration. If you or one of your\ncompanions harms the target, the spells ends.\nAt Higher Levels. When you cast this speil using\na spell slot of 2nd level or higher, you can affect one\nadditional beast for each slot level above 1st.\n",
    "save": "Wisdom"
  },
  "alwodl": {
    "spellId": "alwodl",
    "level": "second",
    "spell_name": "Barkskin",
    "casting_time": "action",
    "range": "Touch",
    "components": [
      "V",
      "S",
      "M",
      "a handful of oak bark) Duration: Concentration, up to 1 hour You touch a willing creature. Until the spell ends, the target's skin has a rough, bark-like appearance, and the target's AC can't be less than 16, regardless of what kind of armor it is wearing."
    ],
    "duration": "Concentration, up to 1 hour",
    "description": "You touch a willing creature. Until the spell ends, the\ntarget's skin has a rough, bark-like appearance, and the\ntarget's AC can't be less than 16, regardless of what kind\nof armor it is wearing.\n"
  },
  "nqoslt": {
    "spellId": "nqoslt",
    "level": "second",
    "spell_name": "Beast Sense",
    "casting_time": "action",
    "range": "Touch",
    "components": ["S"],
    "duration": "Concentration, up to 1 hour",
    "description": "You touch a willing beast. For the duration of the spell,\nyou can use your action to see through the beast's eyes\nand hear what it hears, and continue to do so until\nyou use your action to return to your normal senses.\nWhile perceiving through the beast's senses, you gain\nthe benefits of any special senses possessed by that\ncreature, though you are blinded and deafened to your\nown surroundings\n"
  },
  "fszngb": {
    "spellId": "fszngb",
    "level": "first",
    "spell_name": "Charm Person",
    "casting_time": "action",
    "range": "30 feet",
    "components": ["V"],
    "duration": "1 hour",
    "description": "You attempt to charm a humanoid you can see within\nrange. It must make a Wisdom saving throw, and does\nso with advantage if you or your companions are fighting\nit. If it fails the saving throw, it is charmed by you until\nthe spell ends or until you or your companions do\nanything harmful to it. The charmed creature regards\nyou as a friendly acquaintance. When the spell ends, the\ncreature knows it was charmed by you.\nAt Higher Levels. When you cast this spell using\na spell slot of 2nd level or higher, you can target one\n",
    "save": "Wisdom"
  },
  "mjgjgt": {
    "spellId": "mjgjgt",
    "level": "first",
    "spell_name": "Create Or Destroy Water",
    "casting_time": "action",
    "range": "30 feet",
    "components": [
      "V",
      "S",
      "M",
      "a drop of water if creating or a few grains of sand if destroying it"
    ],
    "duration": "Instantaneous",
    "description": "You either create or destroy water.\nCreate Water. You create up to 10 gallons of clean\nwater within range in an open container. Alternatively,\nthe water falls as rain in a 30-foot cube within range\nextinguishing exposed flames in the area.\nDestroy Water. You destroy up to 10 gallons of water\nin an open container within range. Alternatively, you\ndestroy fog in a 30-foot cube within range.\nAt Higher Levels. When you cast this spell using a\nspell slot of 2nd level or higher, you create or destroy\n10 additional gallons of water, or the size of the cube\nincreases by 5 feet, for each slot level above 1st.\n"
  },
  "dbuuyb": {
    "spellId": "dbuuyb",
    "level": "second",
    "spell_name": "Darkvision",
    "casting_time": "action",
    "range": "Touch",
    "components": ["V", "S", "M", "either a pinch of dried carrot or an agate"],
    "duration": "8 hours",
    "description": "You touch a willing creature to grant it the ability to\nsee in the dark. For the duration, that creature has\ndarkvision out to a range of 60 feet.\n"
  },
  "mszebg": {
    "spellId": "mszebg",
    "level": "first",
    "spell_name": "Detect Magic",
    "casting_time": "action",
    "range": "Self",
    "components": ["V"],
    "duration": "Concentration, up to 10 minutes",
    "description": "For the duration, you sense the presence of magic\nwithin 30 feet of you. If you sense magic in this way, you\ncan use your action to see a faint aura around any visible\ncreature or object in the area that bears magic, and you\nlearn its school of magic, if any.\nThe spell can penetrate most barriers, but it is blocked\nby 1 foot of stone, 1 inch of common metal, a thin sheet\nof lead, or 3 feet of wood or dirt.\n"
  },
  "hnbtur": {
    "spellId": "hnbtur",
    "level": "first",
    "spell_name": "Detect Poison And Disease",
    "casting_time": "action",
    "range": "Self",
    "components": [
      "V",
      "S",
      "M",
      "a yew leaf) Duration: Concentration, up to 10 minutes For the duration, you can sense the presence and location of poisons, poisonous creatures, and dise ases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt"
    ],
    "duration": "Concentration, up to 10 minutes",
    "description": "For the duration, you can sense the presence and\nlocation of poisons, poisonous creatures, and dise ases\nwithin 30 feet of you. You also identify the kind of\npoison, poisonous creature, or disease in each case\nThe spell can penetrate most barriers, but it is blocked\nby 1 foot of stone, 1 inch of common metal, a thin sheet\nof lead, or 3 feet of wood or dirt\n"
  },
  "ilddof": {
    "spellId": "ilddof",
    "level": "second",
    "spell_name": "Enhance Ability",
    "casting_time": "action",
    "range": "Touch",
    "components": [
      "V",
      "S",
      "M",
      "fur or a feather from a beast) Duration: Concentration, up to 1 hour. You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends Bear's Endurance. The target has advantage on Constitution checks. It also gains 2d6 temporary hit points, which are lost when the spell ends. Bull's Strength. The target has advantage on Strength checks, and his or her carrying capacity doubles Cat's Grace. The target has advantage on Dexterity checks. It also doesn't take damage from falling 20 feet or less if it isn't incapacitated Eagle's Splendor. The target has advantage on Charisma checks Fox's Cunning. The target has advantage on Intelligence checks. Owl's Wisdom. The target has advantage on Wisdom checks. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
    ],
    "duration": "Concentration, up to 1 hour.",
    "description": "You touch a creature and bestow upon it a magical\nenhancement. Choose one of the following effects; the\ntarget gains that effect until the spell ends\nBear's Endurance. The target has advantage on\nConstitution checks. It also gains 2d6 temporary hit\npoints, which are lost when the spell ends.\nBull's Strength. The target has advantage\non Strength checks, and his or her carrying\ncapacity doubles\nCat's Grace. The target has advantage on Dexterity\nchecks. It also doesn't take damage from falling 20 feet\nor less if it isn't incapacitated\nEagle's Splendor. The target has advantage on\nCharisma checks\nFox's Cunning. The target has advantage on\nIntelligence checks.\nOwl's Wisdom. The target has advantage on\nWisdom checks.\nAt Higher Levels. When you cast this spell using\na spell slot of 3rd level or higher, you can target one\nadditional creature for each slot level above 2nd.\n",
    "damage": "2d6 temporary"
  },
  "cqjazr": {
    "spellId": "cqjazr",
    "level": "first",
    "spell_name": "Εντangle",
    "casting_time": "action",
    "range": "90 feet",
    "components": ["V"],
    "duration": "Concentration, up to 1 minute",
    "description": "Grasping weeds and vines sprout from the ground in a\n20-foot square starting from a point within range. For\nthe duration, these plants turn the ground in the area\ninto difficult terrain.\nA creature in the area when you cast the spell must\nsucceed on a Strength saving throw or be restrained\nby the entangling plants until the spell ends. A creature\nrestrained by the plants can use its action to make\na Strength check against your spell save DC. On a\nsuccess, it frees itself.\nWhen the spell ends. the conjured plants wilt away\n",
    "save": "Strength"
  },
  "mfwsvk": {
    "spellId": "mfwsvk",
    "level": "first",
    "spell_name": "Faerie Fire",
    "casting_time": "action",
    "range": "60 feet",
    "components": ["V"],
    "duration": "Concentration, up to 1 minute",
    "description": "Each object in a 20-foot cube within range is outlined in\nblue, green, or violet light (your choice). Any creature in\nthe area when the spell is cast is also outlined in light if\nit fails a Dexterity saving throw. For the duration, objects\nand affected creatures shed dim light in a 10-foot radius.\nAny attack roll against an affected creature or object\nhas advantage if the attacker can see it, and the affected\ncreature or object can't benefit from being invisible\n",
    "save": "Dexterity"
  },
  "qhjiul": {
    "spellId": "qhjiul",
    "level": "second",
    "spell_name": "Find Traps",
    "casting_time": "action",
    "range": "120 feet",
    "components": ["V"],
    "duration": "Instantaneous",
    "description": "You sense the presence of any trap within range that\nis within line of sight. A trap, for the purpose of this\nspell, includes anything that would inflict a sudden or\nunexpected effect you consider harmful or undesirable,\nwhich was specifically intended as such by its creator\nThus, the spell would sense an area affected by the\nalarm spell, a glyph of warding, or a mechanical pit trap,\nbut it would not reveal a natural weakness in the floor,\nan unstable ceiling, or a hidden sinkhole.\nThis spell merely reveals that a trap is present. You\ndon't learn the location of each trap, but you do learn the\ngeneral nature of the danger posed by a trap you sense\n"
  },
  "hdbacw": {
    "spellId": "hdbacw",
    "level": "second",
    "spell_name": "Flame Blade",
    "casting_time": "bonus action",
    "range": "Self",
    "components": [
      "V",
      "S",
      "M",
      "leaf of sumac) Duration: Concentration, up to 10 minutes You evoke a fiery blade in your free hand. The blade is similar in size and shape to a scimitar, and it lasts for the duration. If you let go of the blade, it disappears, but you can evoke the blade again as a bonus action. You can use your action to makea melee spell attack with the fiery blade. On a hit, the target takes 3d6 fire damage. The flaming blade sheds bright light in a 10-foot radius and dim light for an additional 10 feet At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage increases by Id6 for every two slot levels above 2nd"
    ],
    "duration": "Concentration, up to 10 minutes",
    "description": "You evoke a fiery blade in your free hand. The blade is\nsimilar in size and shape to a scimitar, and it lasts for\nthe duration. If you let go of the blade, it disappears, but\nyou can evoke the blade again as a bonus action.\nYou can use your action to makea melee spell\nattack with the fiery blade. On a hit, the target takes\n3d6 fire damage.\nThe flaming blade sheds bright light in a 10-foot\nradius and dim light for an additional 10 feet\nAt Higher Levels. When you cast this spell using a\nspell slot of 4th level or higher, the damage increases by\nId6 for every two slot levels above 2nd\n",
    "damage": "3d6 fire"
  },
  "jwqwfe": {
    "spellId": "jwqwfe",
    "level": "second",
    "spell_name": "Flaming Sphere",
    "casting_time": "action",
    "range": "60 feet",
    "components": [
      "V",
      "S",
      "M",
      "a bit of tallow, a pinch of brimstone, and a dusting of powdered iron"
    ],
    "duration": "Concentration, up to 1 minute",
    "description": "A 5-foot-diameter sphere of fire appears in an\nunoccupied space of your choice within range and lasts\nfor the duration. Any creature that ends its turn within 5\nfeet of the sphere must make a Dexterity saving throw.\nThe creature takes 2d6 fire damage on a failed save, or\nhalf as much damage on a successful one\nAs a bonus action, you can move the sphere up to 30\nfeet. If you ram the sphere into a creature, that creature\nmust make the saving throw against the sphere's\ndamage, and the sphere stops moving this turn.\nWhen you move the sphere, you can direct it over\nbarriers up to 5 feet tall and jump it across pits up to\n10 feet wide. The sphere ignites flammable objects not\nbeing worn or carried, and it sheds bright light in a\n20-foot radius and dim light for an additional 20 feet.\n",
    "save": "Dexterity",
    "damage": "2d6 fire"
  },
  "kldxsx": {
    "spellId": "kldxsx",
    "level": "first",
    "spell_name": "Fog Cloud",
    "casting_time": "action",
    "range": "120 feet",
    "components": ["V"],
    "duration": "Concentration, up to 1 hour",
    "description": "You create a 20-foot-radius sphere of fog centered on a\npoint within range. The sphere spreads around corners\nand its area is heavily obscured. It lasts for the duration\nor until a wind of moderate or greater speed (at least 10\nmiles per hour) disperses it.\nAt Higher Levels. When you cast this spell using\nspell slot of 2nd level or higher, the radius of the fog\nincreases by 20 feet for each slot level above 1st.\n"
  },
  "eciela": {
    "spellId": "eciela",
    "level": "first",
    "spell_name": "Goodberry",
    "casting_time": "action",
    "range": "Touch",
    "components": [
      "V",
      "S",
      "M",
      "a sprig of mistletoe) Duration: Instantaneous Up to ten berries appear in your hand and are infused with magic for the duration. A creature can use its action to eat one berry. Eating a berry restores 1 hit point, and the berry provides enough nourishment to sustain a creature for one day The berries lose their potency if they have not been consumed within 24 hours of the casting of this spell"
    ],
    "duration": "Instantaneous",
    "description": "Up to ten berries appear in your hand and are infused\nwith magic for the duration. A creature can use its\naction to eat one berry. Eating a berry restores 1 hit\npoint, and the berry provides enough nourishment to\nsustain a creature for one day\nThe berries lose their potency if they have not been\nconsumed within 24 hours of the casting of this spell\n"
  },
  "rkyjux": {
    "spellId": "rkyjux",
    "level": "second",
    "spell_name": "Gust Of Wind",
    "casting_time": "action",
    "range": "Self (60-foot line)",
    "components": [
      "V",
      "S",
      "M",
      "a legume seed) Duration: Concentration, up to 1 minute A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a Strength saving throw or be pushed 15 feet away from you in a direction following the line. Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you The gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them. As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you"
    ],
    "duration": "Concentration, up to 1 minute",
    "description": "A line of strong wind 60 feet long and 10 feet wide\nblasts from you in a direction you choose for the spell's\nduration. Each creature that starts its turn in the line\nmust succeed on a Strength saving throw or be pushed\n15 feet away from you in a direction following the line.\nAny creature in the line must spend 2 feet of\nmovement for every 1 foot it moves when moving\ncloser to you\nThe gust disperses gas or vapor, and it extinguishes\ncandles, torches, and similar unprotected flames in\nthe area. It causes protected flames, such as those of\nlanterns, to dance wildly and has a 50 percent chance to\nextinguish them.\nAs a bonus action on each of your turns before the\nspell ends, you can change the direction in which the\nline blasts from you\n",
    "save": "Strength"
  },
  "dlnyuo": {
    "spellId": "dlnyuo",
    "level": "first",
    "spell_name": "Healing Word",
    "casting_time": "bonus action",
    "range": "60 feet",
    "components": ["V"],
    "duration": "Instantaneous",
    "description": "A creature of your choice that you can see within range\nregains hit points equal to 1d4 +your spellcasting\nability modifier. This spell has no effect on undead\nor constructs.\nAt Higher Levels. When you cast this spell using a\nspell slot of 2nd level or higher, the healing increases by\nId4 for each slot level above 1st.\n",
    "damage": "1d4 +your"
  },
  "reyquz": {
    "spellId": "reyquz",
    "level": "second",
    "spell_name": "Hold Person",
    "casting_time": "action",
    "range": "60 feet",
    "components": [
      "V",
      "S",
      "M",
      "a small, straight piece of iron) Duration: Concentration, up to 1 minute Choose a humanoid that you can see within range The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target. At Higher Levels. When you cast this spell using a spel slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them."
    ],
    "duration": "Concentration, up to 1 minute",
    "description": "Choose a humanoid that you can see within range\nThe target must succeed on a Wisdom saving throw\nor be paralyzed for the duration. At the end of each of\nits turns, the target can make another Wisdom saving\nthrow. On a success, the spell ends on the target.\nAt Higher Levels. When you cast this spell using\na spel slot of 3rd level or higher, you can target one\nadditional humanoid for each slot level above 2nd. The\nhumanoids must be within 30 feet of each other when\nyou target them.\n",
    "save": "Wisdom"
  },
  "tuhsjd": {
    "spellId": "tuhsjd",
    "level": "fourth",
    "spell_name": "Ice Storm",
    "casting_time": "action",
    "range": "300 feet",
    "components": ["V", "S", "M", "a pinch of dust and a few drops of water"],
    "duration": "Instantaneous",
    "description": "A hail of rock-hard ice pounds to the ground in a\n20-foot-radius, 40-foot-high cylinder centered on a\npoint within range. Each creature in the cylinder must\nmake a Dexterity saving throw. A creature takes 2d8\nbludgeoning damage and 4d6 cold damage on a failed\nsave, or half as much damage on a successful one.\nHailstones turn the storm's area of effect into difficult\nterrain until the end of your next turn.\nAt Higher Levels. When you cast this spell using a\nspell slot of 5th level or higher, the bludgeoning damage\nincreases by ld8 for each slot level above 4th\n",
    "save": "Dexterity",
    "damage": "2d8 bludgeoning and 4d6 cold"
  },
  "nrujlq": {
    "spellId": "nrujlq",
    "level": "first",
    "spell_name": "Jump",
    "casting_time": "action",
    "range": "Touch",
    "components": [
      "V",
      "S",
      "M",
      "a grasshopper's hind leg) Duration: 1 minute You touch a creature. The creature's jump distance is tripled until the spell ends."
    ],
    "duration": "1 minute",
    "description": "You touch a creature. The creature's jump distance is\ntripled until the spell ends.\n"
  },
  "wvuznk": {
    "spellId": "wvuznk",
    "level": "second",
    "spell_name": "Locate Animals Or Plants",
    "casting_time": "action",
    "range": "Self",
    "components": [
      "V",
      "S",
      "M",
      "a bit of fur from a bloodhound) Duration: Instantaneous Describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind within 5 miles, if any are present"
    ],
    "duration": "Instantaneous",
    "description": "Describe or name a specific kind of beast or plant.\nConcentrating on the voice of nature in your\nsurroundings, you learn the direction and distance to\nthe closest creature or plant of that kind within 5 miles,\nif any are present\n"
  },
  "vedtqu": {
    "spellId": "vedtqu",
    "level": "second",
    "spell_name": "Locate Objeсt",
    "casting_time": "action",
    "range": "Self",
    "components": [
      "V",
      "S",
      "M",
      "a forked twig) Duration: Concentration, up to 10 minutes Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement. The spell can locate a specific object known to you, as long as you have seen it up close-within 30 feet-at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon. This spell can't locate an object if any thickness of lead, even a thin sheet, blocks a direct path between you and the object."
    ],
    "duration": "Concentration, up to 10 minutes",
    "description": "Describe or name an object that is familiar to you. You\nsense the direction to the object's location, as long as\nthat object is within 1,000 feet of you. If the object is in\nmotion, you know the direction of its movement.\nThe spell can locate a specific object known to you,\nas long as you have seen it up close-within 30 feet-at\nleast once. Alternatively, the spell can locate the nearest\nobject of a particular kind, such as a certain kind of\napparel, jewelry, furniture, tool, or weapon.\nThis spell can't locate an object if any thickness of\nlead, even a thin sheet, blocks a direct path between you\nand the object.\n"
  },
  "clgxwd": {
    "spellId": "clgxwd",
    "level": "cantrip",
    "spell_name": "Mending",
    "casting_time": "1 minute",
    "range": "Touch",
    "components": [
      "V",
      "S",
      "M",
      "two lodestones) Duration: Instantaneous This spell repairs a single break or tear in an object you touch. such as a broken chain link. two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it. leaving no trace of the former damage. This spell can physically repair a magic item or construct, but the spell can't restore magic such an object"
    ],
    "duration": "Instantaneous",
    "description": "This spell repairs a single break or tear in an object\nyou touch. such as a broken chain link. two halves of\na broken key, a torn cloak, or a leaking wineskin. As\nlong as the break or tear is no larger than 1 foot in\nany dimension, you mend it. leaving no trace of the\nformer damage.\nThis spell can physically repair a magic item\nor construct, but the spell can't restore magic\nsuch an object\n"
  },
  "nmoopv": {
    "spellId": "nmoopv",
    "level": "second",
    "spell_name": "Moonbeam",
    "casting_time": "action",
    "range": "120 feet",
    "components": [
      "SM (Several seeds of any moonseed plant and a piece of opalescent feldspar) Duration: Concentration, Up to 1 minute Classes: Druid A silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder. When a creature enters the spell's area for the first time on a turn or starts its turn there, it is engulfed in ghostly flames that cause searing pain, and it must make a Constitution saving throw. It takes 2d10 radiant damage on a failed save, or half as much damage on a successful one. A shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its original form and can't assume a different form until it leaves the spell's light. On each of your turns after you cast this spell, you can use an action to move the beam 6o feet in any direction At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1dio for each slot level above 2nd"
    ],
    "duration": "Concentration, Up to 1 minute",
    "description": "Classes: Druid\nA silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high cylinder centered on a point\nwithin range. Until the spell ends, dim light fills the cylinder.\nWhen a creature enters the spell's area for the first time on a turn or starts its turn there, it is engulfed\nin ghostly flames that cause searing pain, and it must make a Constitution saving throw. It takes 2d10\nradiant damage on a failed save, or half as much damage on a successful one.\nA shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its\noriginal form and can't assume a different form until it leaves the spell's light.\nOn each of your turns after you cast this spell, you can use an action to move the beam 6o feet in any\ndirection\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases\nby 1dio for each slot level above 2nd\n",
    "save": "Constitution",
    "damage": "2d10 radiant"
  },
  "tamome": {
    "spellId": "tamome",
    "level": "conjuration",
    "spell_name": "Poison Spray",
    "casting_time": "action",
    "range": "10 feet",
    "components": ["V"],
    "duration": "Instantane ous",
    "description": "Classes: Druid, Sorcerer, Warlock, Wizard\nYou extend your hand toward a creature you can see within range and project a puff of noxious\nfrom your palm. The creature must succeed on a Constitution saving throw or take 1d12 poison\ndamage.\ngas\n",
    "save": "Constitution",
    "damage": "1d12 poison"
  },
  "ottguu": {
    "spellId": "ottguu",
    "level": "cantrip",
    "spell_name": "Produce Flame",
    "casting_time": "action",
    "range": "Self",
    "components": ["V"],
    "duration": "10 minutes",
    "description": "A flickering flame appears in your hand. The flame\nremains there for the duration and harms neither you\nnor your equipment. The flame sheds bright light in a\n10-foot radius and dim light for an additional 10 feet\nThe spell ends if you dismiss it as an action or if you\ncast it again.\nYou can also attack with the flame, although doing so\nends the spell. When you cast this spell, or as an action\non a later turn, you can hurl the flame at a creature\nwithin 30 feet of you. Make a ranged spell attack. On a\nhit, the target takes 1d8 fire damage\nThis spell's damage increases by 1d8 when you reach\n5th level (2d8), 11th level (3d8), and 17th level (4d8).\n",
    "damage": "1d8 fire and 1d8 when"
  },
  "ioxssf": {
    "spellId": "ioxssf",
    "level": "second",
    "spell_name": "Protection From Poison",
    "casting_time": "action",
    "range": "Touch",
    "components": ["V"],
    "duration": "1 hour",
    "description": "You touch a creature. If it is poisoned, you neutralize the\npoison. If more than one poison afflicts the target, you\nneutralize one poison that you know is present, or you\nneutralize one at random.\nFor the duration, the target has advantage on saving\nthrows against being poisoned, and it has resistance\npoison damage\n",
    "save": "on"
  },
  "wxfgic": {
    "spellId": "wxfgic",
    "level": "first",
    "spell_name": "Purify Food And Drink",
    "casting_time": "action",
    "range": "10 feet",
    "components": ["V"],
    "duration": "Instantaneous",
    "description": "All nonmagical food and drink within a 5-foot-radius\nsphere centered on a point of your choice within range is\npurified and rendered free of poison and disease.\n"
  },
  "ikdjno": {
    "spellId": "ikdjno",
    "level": "cantrip",
    "spell_name": "Resistance",
    "casting_time": "action",
    "range": "Touch",
    "components": [
      "V",
      "S",
      "M",
      "a miniature cloak) Duration: Concentration, up to 1 minute You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The spell then ends."
    ],
    "duration": "Concentration, up to 1 minute",
    "description": "You touch one willing creature. Once before the spell\nends, the target can roll a d4 and add the number\nrolled to one saving throw of its choice. It can roll\nthe die before or after making the saving throw. The\nspell then ends.\n",
    "save": "one"
  },
  "osmuie": {
    "spellId": "osmuie",
    "level": "cantrip",
    "spell_name": "Shillelagh",
    "casting_time": "bonus action",
    "range": "Touch",
    "components": [
      "V",
      "S",
      "M",
      "mistletoe, a shamrock leaf, and a club or quarterstaff"
    ],
    "duration": "1 minute",
    "description": "The wood of a club or quarterstaff you are holding is\nimbued with nature's power. For the duration, you can\nuse your spellcasting ability instead of Strength for\nthe attack and damage rolls of melee attacks using\nthat weapon, and the weapon's damage die becomes\na d8. The weapon also becomes magical, if it isn't\nalready. The spell ends if you cast it again or if you let go\nof the weapon\n"
  },
  "xfkjgx": {
    "spellId": "xfkjgx",
    "level": "first",
    "spell_name": "Speak With Animals",
    "casting_time": "action",
    "range": "Self",
    "components": ["V"],
    "duration": "10 minutes",
    "description": "You gain the ability to comprehend and verbally\ncommunicate with beasts for the duration. The\nknowledge and awareness of many beasts is limited\nby their intelligence, but at minimum, beasts can\ngive you information about nearby locations and\nmonsters, including whatever they can perceive or have\nperceived within the past day. You might be able to\npersuade a beast to perform a small favor for you, at the\nDM's discretion\n"
  },
  "hllnhj": {
    "spellId": "hllnhj",
    "level": "third",
    "spell_name": "Speak With Plants",
    "casting_time": "action",
    "range": "Self (30-foot radius)",
    "components": ["V"],
    "duration": "10 minutes",
    "description": "You imbue plants within 30 feet of you with limited\nsentience and animation, giving them the ability\nto communicate with you and follow your simple\ncommands. You can question plants about events in the\nspell's area within the past day, gaining information\nabout creatures that have passed, weather, and other\ncircumstances.\nYou can also turn difficult terrain caused by plant\ngrowth (such as thickets and undergrowth) into ordinary\nterrain that lasts for the duration. Or you can turn\nordinary terrain where plants are present into difficult\nterrain that lasts for the duration, causing vines and\nbranches to hinder pursuers, for example\nPlants might be able to perform other tasks on your\nbehalf, at the DM's discretion. The spell doesn't enable\nplants to uproot themselves and move about, but they\ncan freely move branches, tendrils, and stalks.\nIf a plant creature is in the area, you can communicate\nwith it as if you shared a common language, but you\ngain no magical ability to influence it.\nThis spell can cause the plants created by the entangle\nspell to release a restrained creature.\n"
  },
  "qptcmz": {
    "spellId": "qptcmz",
    "level": "second",
    "spell_name": "Spike Growth",
    "casting_time": "action",
    "range": "150 feet",
    "components": [
      "SM (Seven sharp thorns or seven small twigs, each sharpened to a point) Duration: Concentration, Up to 10 minutes Classes: Druid, Ranger The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns. The area becomes difficult terrain for the duration. When a creature moves into or within the area, it takes 2d4 piercing damage for every 5 feet it travels. The transformation of the ground is camouflaged to look natural. Any creature that can't see the area at the time the spell is cast must make a Wisdom (Perception) check against your spell save DC t"
    ],
    "duration": "Concentration, Up to 10 minutes",
    "description": "Classes: Druid, Ranger\nThe ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and\nthorns. The area becomes difficult terrain for the duration. When a creature moves into or within the\narea, it takes 2d4 piercing damage for every 5 feet it travels.\nThe transformation of the ground is camouflaged to look natural. Any creature that can't see the area at\nthe time the spell is cast must make a Wisdom (Perception) check against your spell save DC to\nrecognize the terrain as hazardous before entering it.\n",
    "damage": "2d4 piercing"
  },
  "ilqasf": {
    "spellId": "ilqasf",
    "level": "cantrip",
    "spell_name": "Thorn Whip",
    "casting_time": "action",
    "range": "30 feet",
    "components": [
      "V",
      "S",
      "M",
      "the stem of a plant with thorns) Duration: Instantaneous You create a long, vine-like whip covered in thorns that lashes out at your command towarda creature in range Make a melee spell attack against the target. If the attack hits, the creature takes 1d6 piercing damage, and if the creature is Large or smaller, you pull the creature up to 10 feet closer to you This spell's damage increases by ld6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6"
    ],
    "duration": "Instantaneous",
    "description": "You create a long, vine-like whip covered in thorns that\nlashes out at your command towarda creature in range\nMake a melee spell attack against the target. If the\nattack hits, the creature takes 1d6 piercing damage, and\nif the creature is Large or smaller, you pull the creature\nup to 10 feet closer to you\nThis spell's damage increases by ld6 when you reach\n5th level (2d6), 11th level (3d6), and 17th level (4d6)\n",
    "damage": "1d6 piercing"
  },
  "smcmdb": {
    "spellId": "smcmdb",
    "level": "first",
    "spell_name": "Thunderwave",
    "casting_time": "action",
    "range": "Self (15-foot cube)",
    "components": ["V"],
    "duration": "Instantaneous",
    "description": "Classes: Bard, Druid, Sorcerer, Wizard\nA wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you\nmust make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is\npushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't\npushed. In addition, unsecured objects that are completely within the area of effect are automatically\npushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out\nto 300 feet.\nAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage\nincreases by 1d8 for each slot level above ist.\n",
    "save": "Constitution",
    "damage": "2d8 thunder and 1d8 for"
  },
  "searchLib": {
    "first": [
      {
        "name": "Animal Friendship",
        "id": "idzbeu",
        "time": "action"
      },
      {
        "name": "Charm Person",
        "id": "fszngb",
        "time": "action"
      },
      {
        "name": "Create Or Destroy Water",
        "id": "mjgjgt",
        "time": "action"
      },
      {
        "name": "Detect Magic",
        "id": "mszebg",
        "time": "action"
      },
      {
        "name": "Detect Poison And Disease",
        "id": "hnbtur",
        "time": "action"
      },
      {
        "name": "Εντangle",
        "id": "cqjazr",
        "time": "action"
      },
      {
        "name": "Faerie Fire",
        "id": "mfwsvk",
        "time": "action"
      },
      {
        "name": "Fog Cloud",
        "id": "kldxsx",
        "time": "action"
      },
      {
        "name": "Goodberry",
        "id": "eciela",
        "time": "action"
      },
      {
        "name": "Healing Word",
        "id": "dlnyuo",
        "time": "bonus action"
      },
      {
        "name": "Jump",
        "id": "nrujlq",
        "time": "action"
      },
      {
        "name": "Purify Food And Drink",
        "id": "wxfgic",
        "time": "action"
      },
      {
        "name": "Speak With Animals",
        "id": "xfkjgx",
        "time": "action"
      },
      {
        "name": "Thunderwave",
        "id": "smcmdb",
        "time": "action"
      }
    ],
    "second": [
      {
        "name": "Barkskin",
        "id": "alwodl",
        "time": "action"
      },
      {
        "name": "Beast Sense",
        "id": "nqoslt",
        "time": "action"
      },
      {
        "name": "Darkvision",
        "id": "dbuuyb",
        "time": "action"
      },
      {
        "name": "Enhance Ability",
        "id": "ilddof",
        "time": "action"
      },
      {
        "name": "Find Traps",
        "id": "qhjiul",
        "time": "action"
      },
      {
        "name": "Flame Blade",
        "id": "hdbacw",
        "time": "bonus action"
      },
      {
        "name": "Flaming Sphere",
        "id": "jwqwfe",
        "time": "action"
      },
      {
        "name": "Gust Of Wind",
        "id": "rkyjux",
        "time": "action"
      },
      {
        "name": "Hold Person",
        "id": "reyquz",
        "time": "action"
      },
      {
        "name": "Locate Animals Or Plants",
        "id": "wvuznk",
        "time": "action"
      },
      {
        "name": "Locate Objeсt",
        "id": "vedtqu",
        "time": "action"
      },
      {
        "name": "Moonbeam",
        "id": "nmoopv",
        "time": "action"
      },
      {
        "name": "Protection From Poison",
        "id": "ioxssf",
        "time": "action"
      },
      {
        "name": "Spike Growth",
        "id": "qptcmz",
        "time": "action"
      }
    ],
    "fourth": [
      {
        "name": "Ice Storm",
        "id": "tuhsjd",
        "time": "action"
      }
    ],
    "cantrip": [
      {
        "name": "Mending",
        "id": "clgxwd",
        "time": "1 minute"
      },
      {
        "name": "Produce Flame",
        "id": "ottguu",
        "time": "action"
      },
      {
        "name": "Resistance",
        "id": "ikdjno",
        "time": "action"
      },
      {
        "name": "Shillelagh",
        "id": "osmuie",
        "time": "bonus action"
      },
      {
        "name": "Thorn Whip",
        "id": "ilqasf",
        "time": "action"
      },
      {
        "name": "Poison Spray",
        "id": "tamome",
        "time": "action"
      }
    ],
    "third": [
      {
        "name": "Speak With Plants",
        "id": "hllnhj",
        "time": "action"
      }
    ]
  }
}
