{
	"index": [
		"Aid",
		"Animal Friendship",
		"Augury",
		"Bane",
		"Barkskin",
		"Beast Sense",
		"Blindness/deafness",
		"Burning Hands",
		"Calm Emotions",
		"Charm Person",
		"Сommand",
		"Continual Flame",
		"Create Or Destroy Water",
		"Cure Wounds",
		"Darkvision",
		"Detect Evil And",
		"Detect Magic",
		"Detect Poison And Disease",
		"Enhance Ability",
		"Εντangle",
		"Faerie Fire",
		"Find Traps",
		"Flame Blade",
		"Flaming Sphere",
		"Fog Cloud",
		"Gentle Repose",
		"Goodberry",
		"Guiding Bolt",
		"Gust Of Wind",
		"Healing Word",
		"Hold Person",
		"Ice Storm",
		"Jump",
		"Light",
		"Locate Animals Or Plants",
		"Locate Objeсt",
		"Mending",
		"Moonbeam",
		"Poison Spray",
		"Prayer Of Healing",
		"Produce Flame",
		"Protection From Good And Evil",
		"Protection From Poison",
		"Purify Food And Drink",
		"Resistance",
		"Dx",
		"Sanctuary",
		"Free Membership",
		"Shield Of Faith",
		"Shillelagh",
		"Silence",
		"Speak With Animals",
		"Speak With Plants",
		"Spike Growth",
		"Spiritual Weapon",
		"Thaumaturgy",
		"Thorn Whip",
		"Thunderwave",
		"Warding Bond",
		"Zone Of Truth"
	],
	"qlwldf": {
		"spellId": "qlwldf",
		"level": "second",
		"spell_name": "Aid",
		"casting_time": "action",
		"range": "30 feet",
		"components": [
			"V",
			"S",
			"M",
			"a tiny strip of white cloth"
		],
		"duration": "8 hours",
		"description": "Your spell bolsters your allies with toughness and resolve.\nChoose up to three creatures within range. Each target's\nhit point maximum and current hit points increase by 5 for\nthe duration\nAt Higher Levels. When you cast this spell using a spell\nslot of 3rd level or higher, a target's hit points increase by\nan additional 5 for each slot level above 2nd.\n",
		"save": "None"
	},
	"zhudgz": {
		"spellId": "zhudgz",
		"level": "first",
		"spell_name": "Animal Friendship",
		"casting_time": "action",
		"range": "30 feet",
		"components": [
			"V",
			"S",
			"M",
			"a morsel of food"
		],
		"duration": "24 hours",
		"description": "This spell lets you convince a beast that you mean it no\nharm. Choose a beast that you can see within range.\nIt must see and hear you. If the beast's Intelligence is\n4 or higher, the spell fails. Otherwise, the beast must\nsucceed on a Wisdom saving throw or be charmed\nby you for the spell's duration. If you or one of your\ncompanions harms the target, the spells ends.\nAt Higher Levels. When you cast this speil using\na spell slot of 2nd level or higher, you can affect one\nadditional beast for each slot level above 1st.\n",
		"save": "Wisdom"
	},
	"lpnkfb": {
		"spellId": "lpnkfb",
		"level": "second",
		"spell_name": "Augury",
		"casting_time": "1 minute",
		"range": "Self",
		"components": [
			"V",
			"S",
			"M",
			"specially marked sticks, bones, or similar tokens worth at least 25 gp"
		],
		"duration": "Instantaneous",
		"description": "By casting gem-inlaid sticks, rolling dragon bones, laying\nout ornate cards, or employing some other divining tool,\nyou receive an omen from an otherworldly entity about the\nresults of a specific course of action that you plan to take\nwithin the next 30 minutes. The GM chooses from the\nfollowing possible omens:\nWeal, for good results\nWoe, for bad results\nWeal and woe, for both good and bad results\nNothing, for results that aren't especially good or\nbad\nThe spell doesn't take into account any possible\ncircumstances that might change the outcome, such as\nthe casting of additional spells or the loss or gain of a\ncompanion.\nIf you cast the spell two or more times before completing\nyour next long rest, there is a cumulative 25 percent\nchance for each casting after the first that you get a\nrandom reading. The GM makes this roll in secret.\n",
		"save": "None"
	},
	"weaulm": {
		"spellId": "weaulm",
		"level": "first",
		"spell_name": "Bane",
		"casting_time": "action",
		"range": "30 feet",
		"components": [
			"V",
			"S",
			"M",
			"a drop of blood"
		],
		"duration": "Concentration, up to 1 minute",
		"description": "Up to three creatures of your choice that you can see\nwithin range must make Charisma saving throws.\nWhenever a target that fails this saving throw makes an\nattack roll or a saving throw before the spell ends, the\ntarget must roll a d4 and subtract the number rolled from\nthe attack roll or saving throw.\nAt Higher Levels. When you cast this spell using a spell\nslot of 2nd level or higher, you can target one additional\ncreature for each slot level above 1st.\nII\n",
		"save": "Charisma"
	},
	"agxgml": {
		"spellId": "agxgml",
		"level": "second",
		"spell_name": "Barkskin",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"a handful of oak bark"
		],
		"duration": "Concentration, up to 1 hour",
		"description": "You touch a willing creature. Until the spell ends, the\ntarget's skin has a rough, bark-like appearance, and the\ntarget's AC can't be less than 16, regardless of what kind\nof armor it is wearing.\n",
		"save": "None"
	},
	"kjfseq": {
		"spellId": "kjfseq",
		"level": "second",
		"spell_name": "Beast Sense",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"S"
		],
		"duration": "Concentration, up to 1 hour",
		"description": "You touch a willing beast. For the duration of the spell,\nyou can use your action to see through the beast's eyes\nand hear what it hears, and continue to do so until\nyou use your action to return to your normal senses.\nWhile perceiving through the beast's senses, you gain\nthe benefits of any special senses possessed by that\ncreature, though you are blinded and deafened to your\nown surroundings\n",
		"save": "None"
	},
	"oiopmx": {
		"spellId": "oiopmx",
		"level": "second",
		"spell_name": "Blindness/deafness",
		"casting_time": "action",
		"range": "30 feet",
		"components": [
			"V"
		],
		"duration": "1 minute",
		"description": "You can blind or deafen a foe. Choose one creature that\nyou can see within range to make a Constitution saving\nthrow. If it fails, the target is either blinded or deafened\n(your choice) for the duration. At the end of each of its\nturns, the target can make a Constitution saving throw. On\na success, the spell ends.\nAt Higher Levels. When you cast this spell using a spell\nslot of 3rd level or higher, you can target one additional\ncreature for each slot level above 2nd.\nX\n",
		"save": "Constitution"
	},
	"dmcqee": {
		"spellId": "dmcqee",
		"level": "first",
		"spell_name": "Burning Hands",
		"casting_time": "action",
		"range": "Self (15-foot cone)",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "As you hold your hands with thumbs touching and fingers\nspread, a thin sheet of flames shoots forth from your\noutstretched fingertips. Each creature in a 15-foot cone must\nmake a Dexterity saving throw. A creature takes 3d6 fire\ndamage on a failed save, or half as much damage on a\nsuccessful one.\nThe fire ignites any flammable objects in the area that aren't\nbeing worn or carried\nAt Higher Levels. When you cast this spell using a spell slot of\n2nd level or higher, the damage increases by 1d6 for each slot\nlevel above 1st",
		"save": "Dexterity",
		"damage": "3d6 fire plus 1d6 per spell level above base"
	},
	"dozcis": {
		"spellId": "dozcis",
		"level": "second",
		"spell_name": "Calm Emotions",
		"casting_time": "Time:1 action",
		"range": "60 feet",
		"components": [
			"V"
		],
		"duration": "Concentration, up to 1 minute",
		"description": "You attempt to suppress strong emotions in a group of\npeople. Each humanoid in a 20-foot-radius sphere\ncentered on a point you choose within range must make a\nCharisma saving throw; a creature can choose to fail this\nsaving throw if it wishes. If a creature fails its saving\nthrow, choose one of the following two effects.\nYou can suppress any effect causing a target to be\ncharmed or frightened. When this spell ends, any\nsuppressed effect resumes, provided that its duration has\nnot expired in the meantime.\nAlternatively, you can make a target indifferent about\ncreatures of your choice that it is hostile toward. This\nindifference ends if the target is attacked or harmed by a\nspell or if it witnesses any of its friends being harmed.\nWhen the spell ends, the creature becomes hostile again,\nunless the GM rules otherwise\n",
		"save": "Charisma"
	},
	"fpqvjw": {
		"spellId": "fpqvjw",
		"level": "first",
		"spell_name": "Charm Person",
		"casting_time": "action",
		"range": "30 feet",
		"components": [
			"V"
		],
		"duration": "1 hour",
		"description": "You attempt to charm a humanoid you can see within\nrange. It must make a Wisdom saving throw, and does\nso with advantage if you or your companions are fighting\nit. If it fails the saving throw, it is charmed by you until\nthe spell ends or until you or your companions do\nanything harmful to it. The charmed creature regards\nyou as a friendly acquaintance. When the spell ends, the\ncreature knows it was charmed by you.\nAt Higher Levels. When you cast this spell using\na spell slot of 2nd level or higher, you can target one\n",
		"save": "Wisdom"
	},
	"xkkwct": {
		"spellId": "xkkwct",
		"level": "first",
		"spell_name": "Сommand",
		"casting_time": "action",
		"range": "60 feet",
		"components": [
			"V"
		],
		"duration": "1 round",
		"description": "You speak a one-word command to a creature you can see\nwithin range. The target must succeed on a Wisdom\nsaving throw or follow the command on its next turn. The\nspell has no effect if the target is undead, if it doesn't\nunderstand your language, or if your command is directly\nharmful to it.\nSome typical commands and their effects follow. You\nmight issue a command other than one described here. If\nyou do so, the GM determines how the target behaves. If\nthe target can't follow your command, the spell ends.\nApproach. The target moves toward you by the shortest\nand most direct route, ending its turn if it moves within 5\nfeet of you.\nDrop. The target drops whatever it is holding and then\nends its turn\nFlee. The target spends its turn moving away from you by\nthe fastest available means\nGrovel. The target falls prone and then ends its turn.\nHalt. The target doesn't move and takes no actions. A\nflying creature stays aloft, provided that it is able to do so.\nIf it must move to stay aloft, it flies the minimum distance\nneeded to remain in the air.\nAt Higher Levels. When you cast this spell using a spell\nslot of 2nd level or higher, you can affect one additional\ncreature for each slot level above 1st. The creatures must\nbe within 30 feet of each other when you target them.\n",
		"save": "Wisdom"
	},
	"rkmccs": {
		"spellId": "rkmccs",
		"level": "second",
		"spell_name": "Continual Flame",
		"casting_time": "Time:1 action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"ruby dust worth 50 gp, spell consumes"
		],
		"duration": "Until dispelled",
		"description": "which the\nA flame, equivalent in brightness to a torch, springs forth\nfrom an object that you touch. The effect looks like a\nregular flame, but it creates no heat and doesn't use\noxygen. A continual flame can be covered or hidden but\nnot smothered or quenched.\nD X\nII\n",
		"save": "None"
	},
	"vqpufp": {
		"spellId": "vqpufp",
		"level": "first",
		"spell_name": "Create Or Destroy Water",
		"casting_time": "action",
		"range": "30 feet",
		"components": [
			"V",
			"S",
			"M",
			"a drop of water if creating or a few grains of sand if destroying it"
		],
		"duration": "Instantaneous",
		"description": "You either create or destroy water.\nCreate Water. You create up to 10 gallons of clean\nwater within range in an open container. Alternatively,\nthe water falls as rain in a 30-foot cube within range\nextinguishing exposed flames in the area.\nDestroy Water. You destroy up to 10 gallons of water\nin an open container within range. Alternatively, you\ndestroy fog in a 30-foot cube within range.\nAt Higher Levels. When you cast this spell using a\nspell slot of 2nd level or higher, you create or destroy\n10 additional gallons of water, or the size of the cube\nincreases by 5 feet, for each slot level above 1st.\n",
		"save": "None"
	},
	"yzagva": {
		"spellId": "yzagva",
		"level": "first",
		"spell_name": "Cure Wounds",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "A creature you touch regains a number of hit points\nequal to ld8+your spellcasting ability modifier. This\nspell has no effect on undead or constructs.\nAt Higher Levels. When you cast this spell using a\nspell slot of 2nd level or higher, the healing increases by\nld8 for each slot level above 1st.\n",
		"save": "None"
	},
	"upegdw": {
		"spellId": "upegdw",
		"level": "second",
		"spell_name": "Darkvision",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"either a pinch of dried carrot or an agate"
		],
		"duration": "8 hours",
		"description": "You touch a willing creature to grant it the ability to\nsee in the dark. For the duration, that creature has\ndarkvision out to a range of 60 feet.\n",
		"save": "None"
	},
	"djzkct": {
		"spellId": "djzkct",
		"level": "first",
		"spell_name": "Detect Evil And",
		"casting_time": "action",
		"range": "Self",
		"components": [
			"V"
		],
		"duration": "Concentration, up to 10 minutes",
		"description": "For the duration, you know if there is an aberration,\ncelestial, elemental, fey, fiend, or undead within 30 feet of\nyou, as well as where the creature is located. Similarly, you\nknow if there is a place or object within 30 feet of you that\nhas been magically consecrated or desecrated.\nThe spell can penetrate most barriers, but it is blocked by\n1 foot of stone, 1 inch of common metal, a thin sheet of\nlead, or 3 feet of wood or dirt.\n",
		"save": "None"
	},
	"bzkksc": {
		"spellId": "bzkksc",
		"level": "first",
		"spell_name": "Detect Magic",
		"casting_time": "action",
		"range": "Self",
		"components": [
			"V"
		],
		"duration": "Concentration, up to 10 minutes",
		"description": "For the duration, you sense the presence of magic\nwithin 30 feet of you. If you sense magic in this way, you\ncan use your action to see a faint aura around any visible\ncreature or object in the area that bears magic, and you\nlearn its school of magic, if any.\nThe spell can penetrate most barriers, but it is blocked\nby 1 foot of stone, 1 inch of common metal, a thin sheet\nof lead, or 3 feet of wood or dirt.\n",
		"save": "None"
	},
	"ikjkds": {
		"spellId": "ikjkds",
		"level": "first",
		"spell_name": "Detect Poison And Disease",
		"casting_time": "action",
		"range": "Self",
		"components": [
			"V",
			"S",
			"M"
		],
		"duration": "Concentration, up to 10 minutes",
		"description": "For the duration, you can sense the presence and\nlocation of poisons, poisonous creatures, and dise ases\nwithin 30 feet of you. You also identify the kind of\npoison, poisonous creature, or disease in each case\nThe spell can penetrate most barriers, but it is blocked\nby 1 foot of stone, 1 inch of common metal, a thin sheet\nof lead, or 3 feet of wood or dirt\n",
		"save": "None"
	},
	"mxxehp": {
		"spellId": "mxxehp",
		"level": "second",
		"spell_name": "Enhance Ability",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"fur or a feather from a beast"
		],
		"duration": "Concentration, up to 1 hour.",
		"description": "You touch a creature and bestow upon it a magical\nenhancement. Choose one of the following effects; the\ntarget gains that effect until the spell ends\nBear's Endurance. The target has advantage on\nConstitution checks. It also gains 2d6 temporary hit\npoints, which are lost when the spell ends.\nBull's Strength. The target has advantage\non Strength checks, and his or her carrying\ncapacity doubles\nCat's Grace. The target has advantage on Dexterity\nchecks. It also doesn't take damage from falling 20 feet\nor less if it isn't incapacitated\nEagle's Splendor. The target has advantage on\nCharisma checks\nFox's Cunning. The target has advantage on\nIntelligence checks.\nOwl's Wisdom. The target has advantage on\nWisdom checks.\nAt Higher Levels. When you cast this spell using\na spell slot of 3rd level or higher, you can target one\nadditional creature for each slot level above 2nd.\n",
		"save": "None",
		"damage": "2d6 temporary"
	},
	"lxmqim": {
		"spellId": "lxmqim",
		"level": "first",
		"spell_name": "Εντangle",
		"casting_time": "action",
		"range": "90 feet",
		"components": [
			"V"
		],
		"duration": "Concentration, up to 1 minute",
		"description": "Grasping weeds and vines sprout from the ground in a\n20-foot square starting from a point within range. For\nthe duration, these plants turn the ground in the area\ninto difficult terrain.\nA creature in the area when you cast the spell must\nsucceed on a Strength saving throw or be restrained\nby the entangling plants until the spell ends. A creature\nrestrained by the plants can use its action to make\na Strength check against your spell save DC. On a\nsuccess, it frees itself.\nWhen the spell ends. the conjured plants wilt away\n",
		"save": "Strength"
	},
	"dxigal": {
		"spellId": "dxigal",
		"level": "first",
		"spell_name": "Faerie Fire",
		"casting_time": "action",
		"range": "60 feet",
		"components": [
			"V"
		],
		"duration": "Concentration, up to 1 minute",
		"description": "Each object in a 20-foot cube within range is outlined in\nblue, green, or violet light (your choice). Any creature in\nthe area when the spell is cast is also outlined in light if\nit fails a Dexterity saving throw. For the duration, objects\nand affected creatures shed dim light in a 10-foot radius.\nAny attack roll against an affected creature or object\nhas advantage if the attacker can see it, and the affected\ncreature or object can't benefit from being invisible\n",
		"save": "Dexterity"
	},
	"crkzuo": {
		"spellId": "crkzuo",
		"level": "second",
		"spell_name": "Find Traps",
		"casting_time": "action",
		"range": "120 feet",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "You sense the presence of any trap within range that\nis within line of sight. A trap, for the purpose of this\nspell, includes anything that would inflict a sudden or\nunexpected effect you consider harmful or undesirable,\nwhich was specifically intended as such by its creator\nThus, the spell would sense an area affected by the\nalarm spell, a glyph of warding, or a mechanical pit trap,\nbut it would not reveal a natural weakness in the floor,\nan unstable ceiling, or a hidden sinkhole.\nThis spell merely reveals that a trap is present. You\ndon't learn the location of each trap, but you do learn the\ngeneral nature of the danger posed by a trap you sense\n",
		"save": "None"
	},
	"wmjhvv": {
		"spellId": "wmjhvv",
		"level": "second",
		"spell_name": "Flame Blade",
		"casting_time": "bonus action",
		"range": "Self",
		"components": [
			"V",
			"S",
			"M"
		],
		"duration": "Concentration, up to 10 minutes",
		"description": "You evoke a fiery blade in your free hand. The blade is\nsimilar in size and shape to a scimitar, and it lasts for\nthe duration. If you let go of the blade, it disappears, but\nyou can evoke the blade again as a bonus action.\nYou can use your action to makea melee spell\nattack with the fiery blade. On a hit, the target takes\n3d6 fire damage.\nThe flaming blade sheds bright light in a 10-foot\nradius and dim light for an additional 10 feet\nAt Higher Levels. When you cast this spell using a\nspell slot of 4th level or higher, the damage increases by\nId6 for every two slot levels above 2nd\n",
		"save": "None",
		"damage": "3d6 fire"
	},
	"ntnufw": {
		"spellId": "ntnufw",
		"level": "second",
		"spell_name": "Flaming Sphere",
		"casting_time": "action",
		"range": "60 feet",
		"components": [
			"V",
			"S",
			"M",
			"a bit of tallow, a pinch of brimstone, and a dusting of powdered iron"
		],
		"duration": "Concentration, up to 1 minute",
		"description": "A 5-foot-diameter sphere of fire appears in an\nunoccupied space of your choice within range and lasts\nfor the duration. Any creature that ends its turn within 5\nfeet of the sphere must make a Dexterity saving throw.\nThe creature takes 2d6 fire damage on a failed save, or\nhalf as much damage on a successful one\nAs a bonus action, you can move the sphere up to 30\nfeet. If you ram the sphere into a creature, that creature\nmust make the saving throw against the sphere's\ndamage, and the sphere stops moving this turn.\nWhen you move the sphere, you can direct it over\nbarriers up to 5 feet tall and jump it across pits up to\n10 feet wide. The sphere ignites flammable objects not\nbeing worn or carried, and it sheds bright light in a\n20-foot radius and dim light for an additional 20 feet.\n",
		"save": "Dexterity",
		"damage": "2d6 fire"
	},
	"ouuyww": {
		"spellId": "ouuyww",
		"level": "first",
		"spell_name": "Fog Cloud",
		"casting_time": "action",
		"range": "120 feet",
		"components": [
			"V"
		],
		"duration": "Concentration, up to 1 hour",
		"description": "You create a 20-foot-radius sphere of fog centered on a\npoint within range. The sphere spreads around corners\nand its area is heavily obscured. It lasts for the duration\nor until a wind of moderate or greater speed (at least 10\nmiles per hour) disperses it.\nAt Higher Levels. When you cast this spell using\nspell slot of 2nd level or higher, the radius of the fog\nincreases by 20 feet for each slot level above 1st.\n",
		"save": "None"
	},
	"eeeuzl": {
		"spellId": "eeeuzl",
		"level": "second",
		"spell_name": "Gentle Repose",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"a pinch of salt and one copper piece placed on each of the corpse's eyes, which must remain there for the duration"
		],
		"duration": "10 days",
		"description": "You touch a corpse or other remains. For the duration, the\ntarget is protected from decay and can't become undead.\nThe spell also effectively extends the time limit on raising\nthe target from the dead, since days spent under the\ninfluence of this spell don't count against the time limit of\nspells such as raise dead.\nD X\nDECATHLON\nCENTREEATON\n",
		"save": "None"
	},
	"apmarg": {
		"spellId": "apmarg",
		"level": "first",
		"spell_name": "Goodberry",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"a sprig of mistletoe"
		],
		"duration": "Instantaneous",
		"description": "Up to ten berries appear in your hand and are infused\nwith magic for the duration. A creature can use its\naction to eat one berry. Eating a berry restores 1 hit\npoint, and the berry provides enough nourishment to\nsustain a creature for one day\nThe berries lose their potency if they have not been\nconsumed within 24 hours of the casting of this spell\n",
		"save": "None"
	},
	"urfnkd": {
		"spellId": "urfnkd",
		"level": "first",
		"spell_name": "Guiding Bolt",
		"casting_time": "action",
		"range": "120 feet",
		"components": [
			"V"
		],
		"duration": "1 round",
		"description": "A flash of light streaks toward a creature of your choice\nwithin range. Make a ranged spell attack against the\ntarget. On a hit, the target takes 4d6 radiant damage, and\nthe next attack roll made against this target before the end\nof your next turn has advantage, thanks to the mystical\ndim light glittering on the target until then.\nAt Higher Levels. When you cast this spell using a spell\nslot of 2nd level or higher, the damage increases by 1d6\nfor each slot level above 1st\n",
		"save": "None",
		"damage": "4d6 radiant plus 1d6 per spell level above base"
	},
	"mgcwvi": {
		"spellId": "mgcwvi",
		"level": "second",
		"spell_name": "Gust Of Wind",
		"casting_time": "action",
		"range": "Self (60-foot line)",
		"components": [
			"V",
			"S",
			"M"
		],
		"duration": "Concentration, up to 1 minute",
		"description": "A line of strong wind 60 feet long and 10 feet wide\nblasts from you in a direction you choose for the spell's\nduration. Each creature that starts its turn in the line\nmust succeed on a Strength saving throw or be pushed\n15 feet away from you in a direction following the line.\nAny creature in the line must spend 2 feet of\nmovement for every 1 foot it moves when moving\ncloser to you\nThe gust disperses gas or vapor, and it extinguishes\ncandles, torches, and similar unprotected flames in\nthe area. It causes protected flames, such as those of\nlanterns, to dance wildly and has a 50 percent chance to\nextinguish them.\nAs a bonus action on each of your turns before the\nspell ends, you can change the direction in which the\nline blasts from you\n",
		"save": "Strength"
	},
	"aqbyxp": {
		"spellId": "aqbyxp",
		"level": "first",
		"spell_name": "Healing Word",
		"casting_time": "bonus action",
		"range": "60 feet",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "A creature of your choice that you can see within range\nregains hit points equal to 1d4 +your spellcasting\nability modifier. This spell has no effect on undead\nor constructs.\nAt Higher Levels. When you cast this spell using a\nspell slot of 2nd level or higher, the healing increases by\nId4 for each slot level above 1st.\n",
		"save": "None",
		"damage": "1d4 +your"
	},
	"fqfqlp": {
		"spellId": "fqfqlp",
		"level": "second",
		"spell_name": "Hold Person",
		"casting_time": "action",
		"range": "60 feet",
		"components": [
			"V",
			"S",
			"M",
			"a small, straight piece of iron"
		],
		"duration": "Concentration, up to 1 minute",
		"description": "Choose a humanoid that you can see within range\nThe target must succeed on a Wisdom saving throw\nor be paralyzed for the duration. At the end of each of\nits turns, the target can make another Wisdom saving\nthrow. On a success, the spell ends on the target.\nAt Higher Levels. When you cast this spell using\na spel slot of 3rd level or higher, you can target one\nadditional humanoid for each slot level above 2nd. The\nhumanoids must be within 30 feet of each other when\nyou target them.\n",
		"save": "Wisdom"
	},
	"nrsgbz": {
		"spellId": "nrsgbz",
		"level": "fourth",
		"spell_name": "Ice Storm",
		"casting_time": "action",
		"range": "300 feet",
		"components": [
			"V",
			"S",
			"M",
			"a pinch of dust and a few drops of water"
		],
		"duration": "Instantaneous",
		"description": "A hail of rock-hard ice pounds to the ground in a\n20-foot-radius, 40-foot-high cylinder centered on a\npoint within range. Each creature in the cylinder must\nmake a Dexterity saving throw. A creature takes 2d8\nbludgeoning damage and 4d6 cold damage on a failed\nsave, or half as much damage on a successful one.\nHailstones turn the storm's area of effect into difficult\nterrain until the end of your next turn.\nAt Higher Levels. When you cast this spell using a\nspell slot of 5th level or higher, the bludgeoning damage\nincreases by ld8 for each slot level above 4th\n",
		"save": "Dexterity",
		"damage": "2d8 bludgeoning and 4d6 cold"
	},
	"ppgxqy": {
		"spellId": "ppgxqy",
		"level": "first",
		"spell_name": "Jump",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"a grasshopper's hind leg"
		],
		"duration": "1 minute",
		"description": "You touch a creature. The creature's jump distance is\ntripled until the spell ends.\n",
		"save": "None"
	},
	"jykzus": {
		"spellId": "jykzus",
		"level": "cantrip",
		"spell_name": "Light",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"M",
			"(",
			"irefly or phosphorescent moss"
		],
		"duration": "1 hour",
		"description": "You touch one object that is no larger than 10 feet in any\ndimension. Until the spell ends, the object sheds bright\nlight in a 20-foot radius and dim light for an additional 20\nfeet. The light can be colored as you like. Completely\ncovering the object with something opaque blocks the\nlight. The spell ends if you cast it again or dismiss it as an\naction\nIf you target an object held or worn by a hostile creature,\nthat creature must succeed on a Dexterity saving throw to\navoid the spell\n",
		"save": "Dexterity"
	},
	"jwravx": {
		"spellId": "jwravx",
		"level": "second",
		"spell_name": "Locate Animals Or Plants",
		"casting_time": "action",
		"range": "Self",
		"components": [
			"V",
			"S",
			"M",
			"a bit of fur from a bloodhound"
		],
		"duration": "Instantaneous",
		"description": "Describe or name a specific kind of beast or plant.\nConcentrating on the voice of nature in your\nsurroundings, you learn the direction and distance to\nthe closest creature or plant of that kind within 5 miles,\nif any are present\n",
		"save": "None"
	},
	"qooupj": {
		"spellId": "qooupj",
		"level": "second",
		"spell_name": "Locate Objeсt",
		"casting_time": "action",
		"range": "Self",
		"components": [
			"V",
			"S",
			"M"
		],
		"duration": "Concentration, up to 10 minutes",
		"description": "Describe or name an object that is familiar to you. You\nsense the direction to the object's location, as long as\nthat object is within 1,000 feet of you. If the object is in\nmotion, you know the direction of its movement.\nThe spell can locate a specific object known to you,\nas long as you have seen it up close-within 30 feet-at\nleast once. Alternatively, the spell can locate the nearest\nobject of a particular kind, such as a certain kind of\napparel, jewelry, furniture, tool, or weapon.\nThis spell can't locate an object if any thickness of\nlead, even a thin sheet, blocks a direct path between you\nand the object.\n",
		"save": "None"
	},
	"ltfcan": {
		"spellId": "ltfcan",
		"level": "cantrip",
		"spell_name": "Mending",
		"casting_time": "1 minute",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M"
		],
		"duration": "Instantaneous",
		"description": "This spell repairs a single break or tear in an object\nyou touch. such as a broken chain link. two halves of\na broken key, a torn cloak, or a leaking wineskin. As\nlong as the break or tear is no larger than 1 foot in\nany dimension, you mend it. leaving no trace of the\nformer damage.\nThis spell can physically repair a magic item\nor construct, but the spell can't restore magic\nsuch an object\n",
		"save": "None"
	},
	"zlwpwk": {
		"spellId": "zlwpwk",
		"level": "second",
		"spell_name": "Moonbeam",
		"casting_time": "action",
		"range": "120 feet",
		"components": [
			"SM (Several seeds of any moonseed plant and a piece of opalescent feldspar"
		],
		"duration": "Concentration, Up to 1 minute",
		"description": "Classes: Druid\nA silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high cylinder centered on a point\nwithin range. Until the spell ends, dim light fills the cylinder.\nWhen a creature enters the spell's area for the first time on a turn or starts its turn there, it is engulfed\nin ghostly flames that cause searing pain, and it must make a Constitution saving throw. It takes 2d10\nradiant damage on a failed save, or half as much damage on a successful one.\nA shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its\noriginal form and can't assume a different form until it leaves the spell's light.\nOn each of your turns after you cast this spell, you can use an action to move the beam 6o feet in any\ndirection\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases\nby 1dio for each slot level above 2nd\n",
		"save": "Constitution",
		"damage": "2d10 radiant"
	},
	"twjuxi": {
		"spellId": "twjuxi",
		"level": "conjuration",
		"spell_name": "Poison Spray",
		"casting_time": "action",
		"range": "10 feet",
		"components": [
			"V"
		],
		"duration": "Instantane ous",
		"description": "Classes: Druid, Sorcerer, Warlock, Wizard\nYou extend your hand toward a creature you can see within range and project a puff of noxious\nfrom your palm. The creature must succeed on a Constitution saving throw or take 1d12 poison\ndamage.\ngas\n",
		"save": "Constitution",
		"damage": "1d12 poison"
	},
	"yskwce": {
		"spellId": "yskwce",
		"level": "second",
		"spell_name": "Prayer Of Healing",
		"casting_time": "10 minutes",
		"range": "30 feet",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "Up to six creatures of your choice that you can see within\nrange each regain hit points equal to 2d8+ your\nspellcasting ability modifier. This spell has no effect on\nundead or constructs.\nAt Higher Levels. When you cast this spell using a spell\nslot of 3rd level or higher, the healing increases by 1d8 for\neach slot level above 2nd.\n",
		"save": "None"
	},
	"ffghiu": {
		"spellId": "ffghiu",
		"level": "cantrip",
		"spell_name": "Produce Flame",
		"casting_time": "action",
		"range": "Self",
		"components": [
			"V"
		],
		"duration": "10 minutes",
		"description": "A flickering flame appears in your hand. The flame\nremains there for the duration and harms neither you\nnor your equipment. The flame sheds bright light in a\n10-foot radius and dim light for an additional 10 feet\nThe spell ends if you dismiss it as an action or if you\ncast it again.\nYou can also attack with the flame, although doing so\nends the spell. When you cast this spell, or as an action\non a later turn, you can hurl the flame at a creature\nwithin 30 feet of you. Make a ranged spell attack. On a\nhit, the target takes 1d8 fire damage\nThis spell's damage increases by 1d8 when you reach\n5th level (2d8), 11th level (3d8), and 17th level (4d8).\n",
		"save": "None",
		"damage": "1d8 fire and 1d8 when"
	},
	"ctylse": {
		"spellId": "ctylse",
		"level": "first",
		"spell_name": "Protection From Good And Evil",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"holy wa iron, which the spell consumes"
		],
		"duration": "Concentration up to 10 minutes",
		"description": "Until the spell ends, one willing creature you touch is\nprotected against certain types of creatures: aberrations,\ncelestials, elementals, fey, fiends, and undead.\nThe protection grants several benefits. Creatures of those\ntypes have disadvantage on attack rolls against the target.\nThe target also can't be charmed, frightened, or possessed\nby them. If the target is already charmed, frightened, or\npossessed by such a creature, the target has advantage\non any new saving throw against the relevant effect.\n",
		"save": "new"
	},
	"hivczs": {
		"spellId": "hivczs",
		"level": "second",
		"spell_name": "Protection From Poison",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V"
		],
		"duration": "1 hour",
		"description": "You touch a creature. If it is poisoned, you neutralize the\npoison. If more than one poison afflicts the target, you\nneutralize one poison that you know is present, or you\nneutralize one at random.\nFor the duration, the target has advantage on saving\nthrows against being poisoned, and it has resistance\npoison damage\n",
		"save": "on"
	},
	"dzbqlr": {
		"spellId": "dzbqlr",
		"level": "first",
		"spell_name": "Purify Food And Drink",
		"casting_time": "action",
		"range": "10 feet",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "All nonmagical food and drink within a 5-foot-radius\nsphere centered on a point of your choice within range is\npurified and rendered free of poison and disease.\n",
		"save": "None"
	},
	"etyzvp": {
		"spellId": "etyzvp",
		"level": "cantrip",
		"spell_name": "Resistance",
		"casting_time": "action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M"
		],
		"duration": "Concentration, up to 1 minute",
		"description": "You touch one willing creature. Once before the spell\nends, the target can roll a d4 and add the number\nrolled to one saving throw of its choice. It can roll\nthe die before or after making the saving throw. The\nspell then ends.\n",
		"save": "one"
	},
	"gwavoo": {
		"spellId": "gwavoo",
		"level": "cantrip",
		"spell_name": "Dx",
		"casting_time": "action",
		"range": "60 feet",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "Flame-like radiance descends on a creature that you can\nsee within range. The target must succeed on a Dexterity\nsaving throw or take 1d8 radiant damage. The target gains\nno benefit from cover for this saving throw.\nThe spell's\nlevel (2d8), 11th level (3d8), and 17th level (4d8)\nincreases by 1d8 when you reach 5th\nII\n",
		"save": "Dexterity",
		"damage": "1d8 radiant and 1d8 when"
	},
	"ntirku": {
		"spellId": "ntirku",
		"level": "first",
		"spell_name": "Sanctuary",
		"casting_time": "bonus action",
		"range": "30 feet",
		"components": [
			"V",
			"S",
			"M",
			"a small silver mirror"
		],
		"duration": "1 minute",
		"description": "You ward a creature within range against attack. Until the\nspell ends, any creature who targets the warded creature\nwith an attack or a harmful spell must first make a\nWisdom saving throw. On a failed save, the creature must\nchoose a new target or lose the attack or spell. This spell\ndoesn't protect the warded creature from area effects,\nsuch as the explosion of a fireball.\nIf the warded creature makes an attack or casts a spell\nthat affects an enemy creature, this spell ends\nDX\n",
		"save": "Wisdom"
	},
	"ebyzik": {
		"spellId": "ebyzik",
		"level": "second",
		"spell_name": "Free Membership",
		"casting_time": "action",
		"range": "120 feet",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "You create three rays of fire and hurl them at targets within\nrange. You can hurl them at one target or several. Make a\nranged spell attack for each ray. On a hit, the target takes 2d6\nfire damage\nAt Higher Levels. When you cast this spell using a spell slot of\n3rd level or higher, you create one additional ray for each slot\nlevel above 2nd.\nSpell Lists. Sorcerer, Wizard\n1I\n",
		"save": "None",
		"damage": "2d6 fire"
	},
	"udfhtl": {
		"spellId": "udfhtl",
		"level": "first",
		"spell_name": "Shield Of Faith",
		"casting_time": "bonus action",
		"range": "60 feet",
		"components": [
			"V",
			"S",
			"M",
			"a small parchment with a bit of holy text written on it"
		],
		"duration": "Concentration, up to 10 minutes",
		"description": "A shimmering field appears and surrounds a creature of\nyour choice within range, granting it a +2 bonus to AC for\nthe duration\n",
		"save": "None"
	},
	"bocagy": {
		"spellId": "bocagy",
		"level": "cantrip",
		"spell_name": "Shillelagh",
		"casting_time": "bonus action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"mistletoe, a shamrock leaf, and a club or quarterstaff"
		],
		"duration": "1 minute",
		"description": "The wood of a club or quarterstaff you are holding is\nimbued with nature's power. For the duration, you can\nuse your spellcasting ability instead of Strength for\nthe attack and damage rolls of melee attacks using\nthat weapon, and the weapon's damage die becomes\na d8. The weapon also becomes magical, if it isn't\nalready. The spell ends if you cast it again or if you let go\nof the weapon\n",
		"save": "None"
	},
	"huywmx": {
		"spellId": "huywmx",
		"level": "second",
		"spell_name": "Silence",
		"casting_time": "action",
		"range": "120 feet",
		"components": [
			"V"
		],
		"duration": "Concentration, up to 10 minutes",
		"description": "For the duration, no sound can be created within or pass\nthrough a 20-foot-radius sphere centered on a point you\nchoose within range. Any creature or object entirely inside\nthe sphere is immune to thunder damage, and creatures\nare deafened while entirely inside it. Casting a spell that\nincludes a verbal component is impossible there.\n",
		"save": "None"
	},
	"uoajuy": {
		"spellId": "uoajuy",
		"level": "first",
		"spell_name": "Speak With Animals",
		"casting_time": "action",
		"range": "Self",
		"components": [
			"V"
		],
		"duration": "10 minutes",
		"description": "You gain the ability to comprehend and verbally\ncommunicate with beasts for the duration. The\nknowledge and awareness of many beasts is limited\nby their intelligence, but at minimum, beasts can\ngive you information about nearby locations and\nmonsters, including whatever they can perceive or have\nperceived within the past day. You might be able to\npersuade a beast to perform a small favor for you, at the\nDM's discretion\n",
		"save": "None"
	},
	"bpnaka": {
		"spellId": "bpnaka",
		"level": "third",
		"spell_name": "Speak With Plants",
		"casting_time": "action",
		"range": "Self (30-foot radius)",
		"components": [
			"V"
		],
		"duration": "10 minutes",
		"description": "You imbue plants within 30 feet of you with limited\nsentience and animation, giving them the ability\nto communicate with you and follow your simple\ncommands. You can question plants about events in the\nspell's area within the past day, gaining information\nabout creatures that have passed, weather, and other\ncircumstances.\nYou can also turn difficult terrain caused by plant\ngrowth (such as thickets and undergrowth) into ordinary\nterrain that lasts for the duration. Or you can turn\nordinary terrain where plants are present into difficult\nterrain that lasts for the duration, causing vines and\nbranches to hinder pursuers, for example\nPlants might be able to perform other tasks on your\nbehalf, at the DM's discretion. The spell doesn't enable\nplants to uproot themselves and move about, but they\ncan freely move branches, tendrils, and stalks.\nIf a plant creature is in the area, you can communicate\nwith it as if you shared a common language, but you\ngain no magical ability to influence it.\nThis spell can cause the plants created by the entangle\nspell to release a restrained creature.\n",
		"save": "None"
	},
	"mfbdvp": {
		"spellId": "mfbdvp",
		"level": "second",
		"spell_name": "Spike Growth",
		"casting_time": "action",
		"range": "150 feet",
		"components": [
			"SM (Seven sharp thorns or seven small twigs, each sharpened to a point"
		],
		"duration": "Concentration, Up to 10 minutes",
		"description": "Classes: Druid, Ranger\nThe ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and\nthorns. The area becomes difficult terrain for the duration. When a creature moves into or within the\narea, it takes 2d4 piercing damage for every 5 feet it travels.\nThe transformation of the ground is camouflaged to look natural. Any creature that can't see the area at\nthe time the spell is cast must make a Wisdom (Perception) check against your spell save DC to\nrecognize the terrain as hazardous before entering it.\n",
		"save": "None",
		"damage": "2d4 piercing"
	},
	"couyds": {
		"spellId": "couyds",
		"level": "second",
		"spell_name": "Spiritual Weapon",
		"casting_time": "bonus action",
		"range": "60 feet",
		"components": [
			"V"
		],
		"duration": "1 minute",
		"description": "You create a floating, spectral weapon within range that\nlasts for the duration or until you cast this spell again\nWhen you cast the spell, you can make a melee spell\nattack against a creature within 5 feet of the weapon. On a\nhit, the target takes force damage equal to 1d8 + your\nspellcasting ability modifier.\nAs a bonus action on your turn, you can move the weapon\nup to 20 feet and repeat the attack against a creature\nwithin 5 feet of it.\nThe weapon can take whatever form you choose. Clerics\nof deities who are associated with a particular weapon (as\nSt. Cuthbert is known for his mace and Thor for his\nhammer) make this spell's effect resemble that weapon.\nAt Higher Levels. When you cast this spell using a spell\nslot of 3rd level or higher, the damage increases by 1d8 for\nevery two slot levels above 2nd.\n",
		"save": "None",
		"damage": "1d8 + plus 1d8 per spell level above base"
	},
	"zuteei": {
		"spellId": "zuteei",
		"level": "cantrip",
		"spell_name": "Thaumaturgy",
		"casting_time": "action",
		"range": "30 feet",
		"components": [
			"V"
		],
		"duration": "Up to 1 minute",
		"description": "You manifest a minor wonder, a sign of supernatural\npower, within range. You create one of the following\nmagical effects within range:\nYour voice booms up to three times as loud as\nnormal for 1 minute.\nYou cause flames to flicker, brighten, dim, or change\ncolor for 1 minute.\nYou cause harmless tremors in the ground for 1\nminute.\nYou create an instantaneous sound that originates\nfrom a point of your choice within range, such as a\nrumble of thunder, the cry of a raven, or ominous\nwhispers.\nYou instantaneously cause an unlocked door or\nwindow to fly open or slam shut\nYou alter the appearance of your eyes for 1 minute.\nIf you cast this spell multiple times, you can have up to\nthree of its 1-minute effects active at a time, and you can\ndismiss such an effect as an action.\n",
		"save": "None"
	},
	"assiui": {
		"spellId": "assiui",
		"level": "cantrip",
		"spell_name": "Thorn Whip",
		"casting_time": "action",
		"range": "30 feet",
		"components": [
			"V",
			"S",
			"M",
			"the stem of a plant with thorns"
		],
		"duration": "Instantaneous",
		"description": "You create a long, vine-like whip covered in thorns that\nlashes out at your command towarda creature in range\nMake a melee spell attack against the target. If the\nattack hits, the creature takes 1d6 piercing damage, and\nif the creature is Large or smaller, you pull the creature\nup to 10 feet closer to you\nThis spell's damage increases by ld6 when you reach\n5th level (2d6), 11th level (3d6), and 17th level (4d6)\n",
		"save": "None",
		"damage": "1d6 piercing"
	},
	"syijhc": {
		"spellId": "syijhc",
		"level": "first",
		"spell_name": "Thunderwave",
		"casting_time": "action",
		"range": "Self (15-foot cube)",
		"components": [
			"V"
		],
		"duration": "Instantaneous",
		"description": "Classes: Bard, Druid, Sorcerer, Wizard\nA wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you\nmust make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is\npushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't\npushed. In addition, unsecured objects that are completely within the area of effect are automatically\npushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out\nto 300 feet.\nAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage\nincreases by 1d8 for each slot level above ist.\n",
		"save": "Constitution",
		"damage": "2d8 thunder and 1d8 for"
	},
	"mnmnhf": {
		"spellId": "mnmnhf",
		"level": "second",
		"spell_name": "Warding Bond",
		"casting_time": "Time:1 action",
		"range": "Touch",
		"components": [
			"V",
			"S",
			"M",
			"a pair of platinum rings worth at least 50 gp each, which you and the target must wear for the duration"
		],
		"duration": "1 hour",
		"description": "This spell wards a willing creature you touch and creates a\nmystic connection between you and the target until the\nspell ends. While the target is with in 60 feet of you, it gains\na+1 bonus to AC and saving throws, and it has resistance\nto all damage. Also, each time it takes damage, you take\nthe same amount of damage.\nThe spell ends if you drop to 0 hit points or if you and the\ntarget become separated by more than 60 feet. It also\nends if the spell is cast again on either of the connected\ncreatures. You can also dismiss the spell as an action\nX\nBMW SERIE 5 2015\nPRIX TOUT INCLUS\nII\n",
		"save": "and"
	},
	"zdainq": {
		"spellId": "zdainq",
		"level": "second",
		"spell_name": "Zone Of Truth",
		"casting_time": "action",
		"range": "60 feet",
		"components": [
			"V"
		],
		"duration": "10 minutes",
		"description": "You create a magical zone that guards against deception\nin a 15-foot-radius sphere centered on a point of your\nchoice within range. Until the spell ends, a creature that\nenters the spell's area for the first time on a turn or starts\nits turn there must make a Charisma saving throw. On a\nfailed save, a creature can't speak a deliberate lie while in\nthe radius. You know whether each creature succeeds or\nfails on its saving throw.\nAn affected creature is aware of the spell and can thus\navoid answering questions to which it would normally\nrespond with a lie. Such a creature can be evasive in its\nanswers as long as it remains within the boundaries of the\ntruth\n",
		"save": "Charisma"
	},
	"searchLib": {
		"second": [
			{
				"name": "Aid",
				"id": "qlwldf",
				"time": "action"
			},
			{
				"name": "Augury",
				"id": "lpnkfb",
				"time": "1 minute"
			},
			{
				"name": "Barkskin",
				"id": "agxgml",
				"time": "action"
			},
			{
				"name": "Beast Sense",
				"id": "kjfseq",
				"time": "action"
			},
			{
				"name": "Blindness/deafness",
				"id": "oiopmx",
				"time": "action"
			},
			{
				"name": "Calm Emotions",
				"id": "dozcis",
				"time": "action"
			},
			{
				"name": "Continual Flame",
				"id": "rkmccs",
				"time": "action"
			},
			{
				"name": "Darkvision",
				"id": "upegdw",
				"time": "action"
			},
			{
				"name": "Enhance Ability",
				"id": "mxxehp",
				"time": "action"
			},
			{
				"name": "Find Traps",
				"id": "crkzuo",
				"time": "action"
			},
			{
				"name": "Flame Blade",
				"id": "wmjhvv",
				"time": "bonus action"
			},
			{
				"name": "Flaming Sphere",
				"id": "ntnufw",
				"time": "action"
			},
			{
				"name": "Gentle Repose",
				"id": "eeeuzl",
				"time": "action"
			},
			{
				"name": "Gust Of Wind",
				"id": "mgcwvi",
				"time": "action"
			},
			{
				"name": "Hold Person",
				"id": "fqfqlp",
				"time": "action"
			},
			{
				"name": "X",
				"id": "fawtkt",
				"time": "action"
			},
			{
				"name": "Locate Animals Or Plants",
				"id": "jwravx",
				"time": "action"
			},
			{
				"name": "Locate Objeсt",
				"id": "qooupj",
				"time": "action"
			},
			{
				"name": "Moonbeam",
				"id": "zlwpwk",
				"time": "action"
			},
			{
				"name": "Prayer Of Healing",
				"id": "yskwce",
				"time": "10 minutes"
			},
			{
				"name": "Protection From Poison",
				"id": "hivczs",
				"time": "action"
			},
			{
				"name": "Free Membership",
				"id": "ebyzik",
				"time": "action"
			},
			{
				"name": "Silence",
				"id": "huywmx",
				"time": "action"
			},
			{
				"name": "Spike Growth",
				"id": "mfbdvp",
				"time": "action"
			},
			{
				"name": "Spiritual Weapon",
				"id": "couyds",
				"time": "bonus action"
			},
			{
				"name": "Warding Bond",
				"id": "mnmnhf",
				"time": "action"
			},
			{
				"name": "Zone Of Truth",
				"id": "zdainq",
				"time": "action"
			},
			{
				"name": "Poison Spray",
				"id": "twjuxi",
				"time": "action"
			}
		],
		"first": [
			{
				"name": "Animal Friendship",
				"id": "zhudgz",
				"time": "action"
			},
			{
				"name": "X",
				"id": "weaulm",
				"time": "action"
			},
			{
				"name": "X",
				"id": "bdgdxz",
				"time": "action"
			},
			{
				"name": "Burning Hands",
				"id": "dmcqee",
				"time": "action"
			},
			{
				"name": "Charm Person",
				"id": "fpqvjw",
				"time": "action"
			},
			{
				"name": "Сommand",
				"id": "xkkwct",
				"time": "action"
			},
			{
				"name": "Create Or Destroy Water",
				"id": "vqpufp",
				"time": "action"
			},
			{
				"name": "Cure Wounds",
				"id": "yzagva",
				"time": "action"
			},
			{
				"name": "Detect Evil And",
				"id": "djzkct",
				"time": "action"
			},
			{
				"name": "Detect Magic",
				"id": "bzkksc",
				"time": "action"
			},
			{
				"name": "Detect Poison And Disease",
				"id": "ikjkds",
				"time": "action"
			},
			{
				"name": "Εντangle",
				"id": "lxmqim",
				"time": "action"
			},
			{
				"name": "Faerie Fire",
				"id": "dxigal",
				"time": "action"
			},
			{
				"name": "Fog Cloud",
				"id": "ouuyww",
				"time": "action"
			},
			{
				"name": "Goodberry",
				"id": "apmarg",
				"time": "action"
			},
			{
				"name": "Guiding Bolt",
				"id": "urfnkd",
				"time": "action"
			},
			{
				"name": "Healing Word",
				"id": "aqbyxp",
				"time": "bonus action"
			},
			{
				"name": "X",
				"id": "fgcreb",
				"time": "action"
			},
			{
				"name": "Jump",
				"id": "ppgxqy",
				"time": "action"
			},
			{
				"name": "Protection From Good And Evil",
				"id": "ctylse",
				"time": "action"
			},
			{
				"name": "Purify Food And Drink",
				"id": "dzbqlr",
				"time": "action"
			},
			{
				"name": "Sanctuary",
				"id": "ntirku",
				"time": "bonus action"
			},
			{
				"name": "Shield Of Faith",
				"id": "udfhtl",
				"time": "bonus action"
			},
			{
				"name": "Speak With Animals",
				"id": "uoajuy",
				"time": "action"
			},
			{
				"name": "Thunderwave",
				"id": "syijhc",
				"time": "action"
			}
		],
		"fourth": [
			{
				"name": "Ice Storm",
				"id": "nrsgbz",
				"time": "action"
			}
		],
		"cantrip": [
			{
				"name": "Light",
				"id": "jykzus",
				"time": "action"
			},
			{
				"name": "Mending",
				"id": "ltfcan",
				"time": "1 minute"
			},
			{
				"name": "Produce Flame",
				"id": "ffghiu",
				"time": "action"
			},
			{
				"name": "Resistance",
				"id": "etyzvp",
				"time": "action"
			},
			{
				"name": "Dx",
				"id": "gwavoo",
				"time": "action"
			},
			{
				"name": "Shillelagh",
				"id": "bocagy",
				"time": "bonus action"
			},
			{
				"name": "Dx",
				"id": "qhuxpt",
				"time": "action"
			},
			{
				"name": "Thaumaturgy",
				"id": "zuteei",
				"time": "action"
			},
			{
				"name": "Thorn Whip",
				"id": "assiui",
				"time": "action"
			}
		],
		"third": [
			{
				"name": "Speak With Plants",
				"id": "bpnaka",
				"time": "action"
			}
		]
	}
}